In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
df = pd.DataFrame(np.random.rand(5, 2), columns=["A", "B"])

df

          A         B
0  0.712576  0.519437
1  0.312192  0.756194
2  0.203339  0.618206
3  0.892510  0.661589
4  0.508611  0.754744

In [4]:
df['A'] < 0.5

0    False
1     True
2     True
3    False
4    False
Name: A, dtype: bool

In [5]:
df[(df["A"] < 0.5) & (df["B"] > 0.3)]

          A         B
1  0.312192  0.756194
2  0.203339  0.618206

In [6]:
df.query("A < 0.5 and B > 0.3")

          A         B
1  0.312192  0.756194
2  0.203339  0.618206

In [7]:
condition = (df["A"] < 0.5) & (df["B"] > 0.3)
print(df[condition])

          A         B
1  0.312192  0.756194
2  0.203339  0.618206

In [8]:
# 문자열 조건 검색
data = {
    'Animal' : ['Dog','Cat','Cat','Pig','Cat'],
    'Name' : ['Happy','Sam','Tom','Mini','Rocky']
}

pd.DataFrame(data)

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat    Tom
3    Pig   Mini
4    Cat  Rocky

In [9]:
df = pd.DataFrame(data)
df.head(3)

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat    Tom

In [10]:
df['Animal']

0    Dog
1    Cat
2    Cat
3    Pig
4    Cat
Name: Animal, dtype: object

In [11]:
df['Animal'].str.contains('Cat')
# str.contains() 문자중에 매개변수로 받는 인자가 포함되어 있는지 확인(T/F)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [12]:
df.Animal.str.match('Cat')

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [13]:
df[df['Animal'].str.contains('Cat')]

  Animal   Name
1    Cat    Sam
2    Cat    Tom
4    Cat  Rocky

In [14]:
# apply를 통해서 함수로 데이터 다루기
df = pd.DataFrame(np.arange(5), columns=["Num"])
def square(x):
    return x**2
df["Num"].apply(square)
df["Square"] = df.Num.apply(lambda x: x ** 2)

In [15]:
df

   Num  Square
0    0       0
1    1       1
2    2       4
3    3       9
4    4      16

In [16]:
df = pd.DataFrame(columns=["phone"])
df.loc[0] = "010-1234-1235"
df.loc[1] = "공일공-일이삼사-1235"
df.loc[2] = "010.1234.일이삼오"
df.loc[3] = "공1공-1234.1이3오"
df["preprocess_phone"] = ''

In [17]:
df

           phone preprocess_phone
0  010-1234-1235
1  공일공-일이삼사-1235
2  010.1234.일이삼오
3  공1공-1234.1이3오

In [18]:
def get_preprocess_phone(phone):
    mapping_dict = {
        "공": "0",
        "일": "1",
        "이": "2",
        "삼": "3",
        "사": "4",
        "오": "5",
        "-": "",
        ".": "",
}
    for key, value in mapping_dict.items():
        phone = phone.replace(key, value)
    
    return phone
df["preprocess_phone"] = df["phone"].apply(get_preprocess_phone)
    
df

           phone preprocess_phone
0  010-1234-1235      01012341235
1  공일공-일이삼사-1235      01012341235
2  010.1234.일이삼오      01012341235
3  공1공-1234.1이3오      01012341235

In [19]:
df

           phone preprocess_phone
0  010-1234-1235      01012341235
1  공일공-일이삼사-1235      01012341235
2  010.1234.일이삼오      01012341235
3  공1공-1234.1이3오      01012341235

In [20]:
# replace
data = {'0': 'Male','1':'Male','2':'Male','3':'Female','4':'Female',}
data

{'0': 'Male', '1': 'Male', '2': 'Male', '3': 'Female', '4': 'Female'}

In [21]:
data.values()

dict_values(['Male', 'Male', 'Male', 'Female', 'Female'])

In [22]:
data_list = list(data.values())

In [23]:
pd.DataFrame(data_list,columns=['sex'])

      sex
0    Male
1    Male
2    Male
3  Female
4  Female

In [24]:
df = pd.DataFrame(data_list,columns=['sex'])

df.sex.replace({'Male':0,'Female':1})

0    0
1    0
2    0
3    1
4    1
Name: sex, dtype: int64

In [25]:
df.sex.replace({"Male": 0, "Female": 1}, inplace=True)
df

   sex
0    0
1    0
2    0
3    1
4    1

In [26]:
# 그룹으로 묶기
# 조건부로 집계하고 싶은 경우
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)})
df.groupby('key')
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [27]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [28]:
df.groupby(['key','data']).sum()

Empty DataFrame
Columns: []
Index: [(A, 0), (A, 3), (B, 1), (B, 4), (C, 2), (C, 5)]

In [29]:
# aggregate
# groupby 통해서 집계를 한번에 계산하고자 할 때

data = {
    'group' : ['A','B','A','B','A','B','A','B',],
    'data1' : [20,30,40,20,30,40,20,50],
    'data2' : [1,2,3,4,5,6,7,8]
    
}

pd.DataFrame(data)

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     20      7
7     B     50      8

In [30]:
df = pd.DataFrame(data)
df.head()

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5

In [31]:
df.groupby('group').aggregate(['min', 'median', 'max'])

      data1            data2
        min median max   min median max
group
A        20   25.0  40     1    4.0   7
B        20   35.0  50     2    5.0   8

In [32]:
df.groupby('group').aggregate({'data1': 'min', 'data2': 'sum'})

       data1  data2
group
A         20     16
B         20     20

In [33]:
def filter_by_mean(x):
    return x['data2'].mean() > 3

In [36]:
df

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     20      7
7     B     50      8

In [34]:
df.groupby('group').mean()

       data1  data2
group
A       27.5    4.0
B       35.0    5.0

In [35]:
df.groupby('group').filter(filter_by_mean)

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     20      7
7     B     50      8

In [37]:
df.groupby('group').apply(lambda x: x.max() - x.min())

       data1  data2
group
A         20      6
B         30      6

In [40]:
# get_group
# groupby 로 묶인 데이터에서 key 값으로 데이터 가져오기

df.groupby('group').get_group('A')

  group  data1  data2
0     A     20      1
2     A     40      3
4     A     30      5
6     A     20      7

In [41]:
len(df.groupby('group').get_group('A'))

4

In [43]:
# Multi index
# index 를 계층으로 구성함

df = pd.DataFrame(
np.random.randn(4, 2),
index=[['A', 'A', 'B', 'B'], [1, 2, 1, 2]],
columns=['data1', 'data2']
)

df

        data1     data2
A 1 -0.235717 -0.174154
  2  1.005610  1.600497
B 1  1.021163 -0.445175
  2 -1.237895 -0.121643

In [49]:
df_col = pd.DataFrame(
np.random.randn(4, 4),
columns=[["A", "A", "B", "B"], ["1", "2", "1", "2"]]
)
df_col

          A                   B
          1         2         1         2
0  0.052844  1.018037  2.836074  0.189508
1 -0.002446  1.413029 -0.025275 -0.604299
2  0.508866  0.022262  1.917284  0.730242
3  0.395500  1.678583 -0.031530 -0.308770

In [50]:
df_col['A']

          1         2
0  0.052844  1.018037
1 -0.002446  1.413029
2  0.508866  0.022262
3  0.395500  1.678583

In [51]:
df_col['A']['1']

0    0.052844
1   -0.002446
2    0.508866
3    0.395500
Name: 1, dtype: float64

In [52]:
# pivot_table
# index(행 index로 들어갈 key) 
# columns: 열 index로 라벨링 되는 값
# value : 분석할 데이터 값

df

          A                   B
          1         2         1         2
0 -0.938868 -1.682108  1.252651  0.012806
1 -1.625478  1.506157  1.554057  1.374675
2 -0.841770 -0.516293 -1.312346  0.240327
3 -0.378890  1.172900 -0.028672  0.702352

In [59]:
data = {
    "날짜": ["2020-01-01", "2020-01-01", "2020-01-01", "2020-01-02", "2020-01-02", "2020-01-02"],
    "카테고리": ["과일", "채소", "채소", "과일", "과일", "채소"],
    "수량": [10, 15, 5, 20, 10, 5]
}

In [60]:
pd.DataFrame(data)

           날짜 카테고리  수량
0  2020-01-01   과일  10
1  2020-01-01   채소  15
2  2020-01-01   채소   5
3  2020-01-02   과일  20
4  2020-01-02   과일  10
5  2020-01-02   채소   5

In [66]:
df = pd.DataFrame(data)

df.pivot_table(
    index='날짜',
    columns='카테고리',
    values='수량',
    aggfunc='sum'
)

카테고리        과일  채소
날짜
2020-01-01  10  20
2020-01-02  30   5

In [67]:
df = pd.DataFrame(data)

df.pivot_table(
    index='날짜',
    columns='카테고리',
    values='수량',
    aggfunc='mean'
)

카테고리          과일    채소
날짜
2020-01-01  10.0  10.0
2020-01-02  15.0   5.0